## Reading data from relational database

In [1]:
import pandas as pd

### Reading data from SQL database

##### Reading data from SQL datbase is fairly simple and pandas supports a variety of methods to deal with it.

##### We will start with an example using SQlite as it is a built-in python package and we dont need anything extra installed.

In [2]:
# conda install (package) how to install any package
# pip in python means package installar for python if you are using th default python id
# !to run a package directly from your jupiter note book !pip install sqlana

In [3]:
import sqlite3

##### In other to work with SQlite database from python,we first have to connect to it.We can do that using connect function
##### which returns a connection object.

##### We will use the following data structure

In [4]:
# using chibook to create a connection
conn = sqlite3.connect('C:\\Users\\user\\Downloads\\chinook.db')
 # a key arguement (con) to specify a connection object. but conn is a variable and can as well be changed,if  it to something else

In [5]:
# Once we have a connection object we can then create a cursor object. cursor allows us to execute SQL queries against a database.

In [6]:
#APi is a programm that allows two faces of software to operate together.

In [7]:
cur = conn.cursor()

##### cursor object is used in python is a tool that allows you to further execute sql queries.
##### we use cursor object when we want to execute sql queries cursor.execute after creating an sql query.

In [8]:
#select all record from employees table and limit it to 5 
# output is a generator object ,hence we need to apply another method called the fetch all
# This code will help us fetch the first 5 rows from the emplotees table
cur.execute('SELECT * FROM employees LIMIT 5 ;')

##### You may have noticed that we didnt assign the result of the above table to a variable, this is because we need to run another command
##### to actually fetch the result.

In [9]:
# We will use the fetchall method to fetch all the result of this querry
results = cur.fetchall()

In [10]:
results

[(1,
  'Adams',
  'Andrew',
  'General Manager',
  None,
  '1962-02-18 00:00:00',
  '2002-08-14 00:00:00',
  '11120 Jasper Ave NW',
  'Edmonton',
  'AB',
  'Canada',
  'T5K 2N1',
  '+1 (780) 428-9482',
  '+1 (780) 428-3457',
  'andrew@chinookcorp.com'),
 (2,
  'Edwards',
  'Nancy',
  'Sales Manager',
  1,
  '1958-12-08 00:00:00',
  '2002-05-01 00:00:00',
  '825 8 Ave SW',
  'Calgary',
  'AB',
  'Canada',
  'T2P 2T3',
  '+1 (403) 262-3443',
  '+1 (403) 262-3322',
  'nancy@chinookcorp.com'),
 (3,
  'Peacock',
  'Jane',
  'Sales Support Agent',
  2,
  '1973-08-29 00:00:00',
  '2002-04-01 00:00:00',
  '1111 6 Ave SW',
  'Calgary',
  'AB',
  'Canada',
  'T2P 5M5',
  '+1 (403) 262-3443',
  '+1 (403) 262-6712',
  'jane@chinookcorp.com'),
 (4,
  'Park',
  'Margaret',
  'Sales Support Agent',
  2,
  '1947-09-19 00:00:00',
  '2003-05-03 00:00:00',
  '683 10 Street SW',
  'Calgary',
  'AB',
  'Canada',
  'T2P 5G3',
  '+1 (403) 263-4423',
  '+1 (403) 263-4289',
  'margaret@chinookcorp.com'),
 (5,
  'Johnson',
  'Steve',
  'Sales Support Agent',
  2,
  '1965-03-03 00:00:00',
  '2003-10-17 00:00:00',
  '7727B 41 Ave',
  'Calgary',
  'AB',
  'Canada',
  'T3B 1Y7',
  '1 (780) 836-9987',
  '1 (780) 836-9543',
  'steve@chinookcorp.com')]

##### As you can see the result are returned as a list of turple. Each Turple corressponds  to a row in the database that we accessed
##### Dealing with dat this way is painful.we need to manually add column headers and manually parse the date.Luckily the pandas library
##### has an easier way and we will look at that as well.

In [11]:
df = pd.DataFrame(results) # you need to convert to tabular form to be able to interprete the result.
df

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [12]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

##### We can close connection object and  cursor object that are open using the code below. This is good practice as it presents the SQlite database 
##### from been locked.When an SQlite database is locked , you may be unable to update the database and may get errors.
##### When you want to open it ,you can use cur.open() conn.open() to open it.

In [13]:
cur.close()

In [14]:
conn.close()

### Using pandas read_sql method

##### We can use the pandas read_sql function to read the result of SQL query directly into pandas DataFrame.The code below 
##### will execute the same query that we just did but it will return a dataFrame.It has several advantages over the query we did above.
##### .It doesn't require us to create a cursor object or call fetchall at the end.
##### .it automatically reads in the names of the headers from the table
##### .It creates a DataFrame so you can quickly explore the data.

In [15]:
conn = sqlite3.connect('C:\\Users\\user\\Downloads\\chinook.db')

In [16]:
#conn = sqlite3.connect('chinook.db')

In [17]:
df = pd.read_sql('SELECT * FROM employees',conn)

In [18]:
df.head()

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [19]:
df = pd.read_sql('SELECT * FROM employees;',conn,
                 index_col='EmployeeId',
                 parse_dates=['BirthDate', 'HireDate'])

In [20]:
df.head()

,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
EmployeeId,,,,,,,,,,,,,,
1,Adams,Andrew,General Manager,NaN,1962-02-18,2002-08-14,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
2,Edwards,Nancy,Sales Manager,1.0,1958-12-08,2002-05-01,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29,2002-04-01,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
4,Park,Margaret,Sales Support Agent,2.0,1947-09-19,2003-05-03,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03,2003-10-17,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8 entries, 1 to 8
Data columns (total 14 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   LastName    8 non-null      object
 1   FirstName   8 non-null      object
 2   Title       8 non-null      object
 3   ReportsTo   7 non-null      float64
 4   BirthDate   8 non-null      datetime64[ns]
 5   HireDate    8 non-null      datetime64[ns]
 6   Address     8 non-null      object
 7   City        8 non-null      object
 8   State       8 non-null      object
 9   Country     8 non-null      object
 10  PostalCode  8 non-null      object
 11  Phone       8 non-null      object
 12  Fax         8 non-null      object
 13  Email       8 non-null      object
dtypes: datetime64[ns](2), float64(1), object(11)
memory usage: 960.0+ bytes

In [22]:
df['ReportsTo'].isna().sum()

1

In [23]:
df['ReportsTo'].mean()

2.857142857142857

In [24]:
df['ReportsTo'] > 1.75

EmployeeId
1    False
2    False
3     True
4     True
5     True
6    False
7     True
8     True
Name: ReportsTo, dtype: bool

In [25]:
df['City'] = df['City'].astype('category')

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8 entries, 1 to 8
Data columns (total 14 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   LastName    8 non-null      object
 1   FirstName   8 non-null      object
 2   Title       8 non-null      object
 3   ReportsTo   7 non-null      float64
 4   BirthDate   8 non-null      datetime64[ns]
 5   HireDate    8 non-null      datetime64[ns]
 6   Address     8 non-null      object
 7   City        8 non-null      category
 8   State       8 non-null      object
 9   Country     8 non-null      object
 10  PostalCode  8 non-null      object
 11  Phone       8 non-null      object
 12  Fax         8 non-null      object
 13  Email       8 non-null      object
dtypes: category(1), datetime64[ns](2), float64(1), object(10)
memory usage: 1.0+ KB

### Using pandas read_sql_query method

##### It turns out that the read_sql method we saw above is just the wrapper around read_sql_query and read_sql_table
##### We can get the same result using read_sql_query method

In [27]:
conn = sqlite3.connect('C:\\Users\\user\\Downloads\\chinook.db')

In [28]:
conn = sqlite3.connect('chinook.db')

In [29]:
df = pd.read_sql_query('SELECT * FROM employees LIMIT 5', conn)

DatabaseError: Execution failed on sql 'SELECT * FROM employees LIMIT 5': no such table: employees

In [ ]:
df.head()

In [ ]:
df = pd.read_sql_query('employees', conn,
                 index_col='EmployeeId',
                 parse_dates=['BirthDate', 'HireDate'])

In [ ]:
df.head()

#### Using read_sql table method

##### read_sql_table is a useful function, but it works only with SQLAlchemy, a  Python SQL Toolkitmand  Object Relational Mapper.
#### This is just a demonstration of its usage where we read the whole employees table.

In [ ]:
from sqlalchemy import create_engine

In [ ]:
engine = create_engine('sqlite:///chinook.db')

In [ ]:
connection = engine.connect()

In [ ]:
df = pd.read_sql_table('employees', con=connection)

In [ ]:
df.head()

In [ ]:
df = pd.read_sql_table('employees', con=connection,
                 index_col='EmployeeId',
                 parse_dates=['BirthDate', 'HireDate'])

In [ ]:
df.head()

In [ ]:
connection.close()

#### Create tables from DataFrame objects

##### We can persist DataFrame objects we are working on in the database using the pandas to_sql method

##### Although this method is easy to implement, it can be slow

In [ ]:
df.head()

##### Drop the table if needed

In [ ]:
df.to_sql?

In [ ]:
cur = conn.cursor()

In [ ]:
cur.execute('DROP TABLE IF EXISTS employees2;')

In [ ]:
cur.close()

In [ ]:
df.to_sql('employee2',conn)

In [ ]:
pd.read_sql_query('SELECT * FROM employees2;', conn).head()

#### Custom behavior

##### The if_exists parameter define how to behave if the table already exists and add a tone of flexibility letting you to decide whether to replace 
##### current table data,append new data at the end or simply fail if table already exists.

In [ ]:
pd.DataFrame().to_sql('employees2',
                      conn,
                      if_exists='replace')

In [ ]:
pd.read_sql_query('SELECT * FROM employees2;', conn).head()

In [ ]:
df.to_sql('employees2',
                      conn,
                      if_exists='replace')

In [ ]:
pd.read_sql_query('SELECT * FROM employees2;', conn).head()

In [ ]:
import sqlite3

In [ ]:
# using sql function to create table
connection = sqlite3.connect('data.db')

# cursor = connection.cursor()

# cursor.execute("CREATE TABLE STUDENT (Name text, Gender text)")
# cursor.execute("INSERT INTO STUDENT VALUES('Max', 'M')") 
# cursor.execute("INSERT INTO STUDENT VALUES('Sally', 'F')") 
# cursor.execute("INSERT INTO STUDENT VALUES('Sarah', 'F')") 

# connection.commit()

# connection.close()

In [ ]:
connection = sqlite3.connect('data.db')

In [ ]:
cursor = connection.cursor()

In [ ]:
df2 = pd.read_sql('select * from student', connection)

In [ ]:
df2.head()

### How to read some HTML files

##### HTML means HyperText Markup Language support.

In [ ]:
##### creating a good html file depends on the structure of the web page. it is a very quick way of hacking,you can use wekipidia site to get
##### information about a country,s gdp data set, you will see a table and you can directly parse it

#### Loading data

In [ ]:
!pip install lxml

In [ ]:
import pandas as pd

### Parsing raw HTML strings

##### Another useful pandas method is read_html() . This method will read HTML tables from a given URL.A file=like object or a raw string
##### containing HTML and returns a list or DataFrame objects.

##### Let us try to read the following HTML into a DataFrame.

##### * (open sample html for the working example)

In [ ]:
html_string = """
<table>
    <thead>
      <tr>
        <th>Order date</th>
        <th>Region</th> 
        <th>Item</th>
        <th>Units</th>
        <th>Unit cost</th>
      </tr>
    </thead>
    <tbody>
      <tr>
        <td>1/6/2018</td>
        <td>East</td> 
        <td>Pencil</td>
        <td>95</td>
        <td>1.99</td>
      </tr>
      <tr>
        <td>1/23/2018</td>
        <td>Central</td> 
        <td>Binder</td>
        <td>50</td>
        <td>19.99</td>
      </tr>
    <tr>
        <td>2/9/2018</td>
        <td>Central</td> 
        <td>Pencil</td>
        <td>36</td>
        <td>4.99</td>
      </tr>
      <tr>
        <td>3/15/2018</td>
        <td>West</td> 
        <td>Pen</td>
        <td>27</td>
        <td>19.99</td>
      </tr>
    </tbody>
</table>
"""

In [ ]:
from Ipython.core.display import display, HTML
display(HTML(html_string))

In [ ]:
# This helps to look for multiple tables.

In [ ]:
dfs = pd.read_html(html_string)

##### The read_html just returned one DataFrame object

In [ ]:
lens(dfs)

In [ ]:
df = dfs(0)

In [ ]:
df

##### Previous DataFrame looks quite similar to the raw HTML table,but now we have a DataFrame object so we can apply any pandas operation we want to it.

In [ ]:
df.shape

In [ ]:
df.loc[df['Region'] == 'Central']

In [ ]:
df.loc[df['Units'] > 35]

#### Defining header
##### Hyper text back up language

##### Pandas will automatically find the header to use thanks to the tag

##### But in many cases we will find wrong or incomplete tables that makes the read_html method parse the table in a wrong way without the proper headers.

###### To fix them we can use the header parameter

In [ ]:
html_string = """
<table>
    <thead>
      <tr>
        <th>Order date</th>
        <th>Region</th> 
        <th>Item</th>
        <th>Units</th>
        <th>Unit cost</th>
      </tr>
    </thead>
    <tbody>
      <tr>
        <td>1/6/2018</td>
        <td>East</td> 
        <td>Pencil</td>
        <td>95</td>
        <td>1.99</td>
      </tr>
      <tr>
        <td>1/23/2018</td>
        <td>Central</td> 
        <td>Binder</td>
        <td>50</td>
        <td>19.99</td>
      </tr>
    <tr>
        <td>2/9/2018</td>
        <td>Central</td> 
        <td>Pencil</td>
        <td>36</td>
        <td>4.99</td>
      </tr>
      <tr>
        <td>3/15/2018</td>
        <td>West</td> 
        <td>Pen</td>
        <td>27</td>
        <td>19.99</td>
      </tr>
    </tbody>
</table>
"""

In [ ]:
pd.read_html(html_string)[0]

##### In this case, we will need to pass the row number to use as header using the header parameter.

In [ ]:
pd.read_html(html_string, header=0),[0]

#### Parsing html tables from the web

##### Now that we know how read_html works, go one step beyond and try to parse HTML tables directly from an URL

##### To do that we will call the read_html method with an url as parameter.

#### Simple example

In [ ]:
# html_url = "https://www.basketball-reference.com/leagues/NBA_2019_per_game.html"

In [ ]:
# https://www.basketball-reference.com/leagues/NBA_2

In [ ]:
html_url = 'https://www.basketball-reference.com/leagues/NBA_2019_per_game.html'

In [ ]:
nba_tables = pd.read_html(html_url)

In [ ]:
len(nba_tables)

##### We will work with  only one table found

In [ ]:
nba=nba_tables[0]

In [ ]:
nba.head()

In [ ]:
#nunique means number of unique value

In [ ]:
#Read_sql means that you can read all the table

In [ ]:
#append means inserts new values to the existing table

#### Complex example

##### We can also use the request module to get HTML code from an URL to parse it into DataFrame objects.
##### If we look at the given URL we can see multiple tables about the simpsons TV show.
##### We want to keep the table with information about each season

In [ ]:
import requests

In [ ]:
html_url =" https://en.wikipedia.org/wiki/The_Simpsons"

In [ ]:
r = requests.get(html_url)

In [ ]:
wiki_tables = pd.read_html(r.text, header=0)

In [ ]:
len(wiki_tables)

In [ ]:
simpsons = wiki_tables[1]

In [ ]:
simpsons.head()

### Save to CSV file

##### Finally we can also save our DataFrame as CSV file

In [ ]:
exam_df

##### We can simply generate a CSV string from our DataFrame:

In [ ]:
exam-df.to_csv()

##### Or specify a file path where  we want our generated CSV code to be stored.

In [ ]:
exam_df.to_csv('out.csv')

In [ ]:
pd.read_csv('out.csv')

In [ ]:
exam_df.to_csv('out.csv',
              index=None)

In [ ]:
pd.read_csv('out.csv')

## Accessing databases with python

### Using simple API

##### API means application programme interface. It allows two pieces of software communicate with each other ,for example you have
##### your programme, data and  other software components.Just like a function you dont have to know how API works,just like inputs and outputs.
##### Pandas is actually a set of software components and most of them are not written in python, you have  some data and software components,
##### all you need is the pandas API to process it by communicating with other API components.

In [ ]:
# practical example using dictionary
import pandas as pd

In [ ]:
dict_={'a':[11,21, 31], 'b':[12, 22, 32]}
df = pd.DataFrame(dict_)

In [ ]:
df.head()

In [ ]:
df.mean()

In [ ]:
# when you create a dictionary and create an object with DatFrame constructore as shown in the eg. above,in API lingual it is called an instance
# the dat in the dict is passed along to the pandas API and used the DataFrame to communicate with the API, when you call the method head, the
# DataFrame communicates with the API explaining the first two rows of the DataFrame, when you call the method mean, the DF will calculate the 
# mean and return the values.

### Rest API

In [ ]:
##### They are another popular type of API . They allow you to communicate with the internet and to take advantage of resources like storage,
##### access more data,artificial intelligent algorithms and much more.RE stands for representational, S stands for state and T stands for Transfer APIs
##### in Rest APIs your program is called the client
##### Rest APIs are used to interact with web services ie the applications you call through the internet. There are set of rules regarding communication
##### Input or Request and Output or response. the website is referred to as a resource

In [ ]:
#### HTTP METHODS

In [ ]:
##### HTTP methods are ways of transmitting data over the internet.We tell the Rest API what to do by sending a request, the request is usually communicated
##### via an HTTP message, the HTTP mesage usually contains a JASON FILE :like Dictionary , and this contains instructions on what operation we would like the service 
##### the service to perform to perform, this operation i message where the information is usually returned via JSON file and this information is transmitted back to 
##### client.

### nba api

In [ ]:
 ##### nba api was written by Swar Patel.Sports data bs always changing.it is the external application of an APIThe API is always been updated at end points from nba.com
##### it is simple to use so you can focus on the task of colloecting data .In the nba API to make request for a specific team is simple. 
##### You dont require a JSON file, all we require is an ID and the information is stored locally in the API. We import the march teams, the method get
##### teams returns a list of dictionary which are the same keys that the values depends on the team. The dictionay key id have a uninue identifier for each 
##### team as a value.

In [2]:
!pip install nba_api

Collecting nba_api
  Downloading nba_api-1.1.11.tar.gz (125 kB)
Requirement already satisfied: requests in c:\users\user\anaconda3\lib\site-packages (from nba_api) (2.26.0)
Requirement already satisfied: idna<4,>=2.5 in c:\users\user\anaconda3\lib\site-packages (from requests->nba_api) (3.2)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\user\anaconda3\lib\site-packages (from requests->nba_api) (2021.10.8)
Requirement already satisfied: charset-normalizer~=2.0.0 in c:\users\user\anaconda3\lib\site-packages (from requests->nba_api) (2.0.4)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in c:\users\user\anaconda3\lib\site-packages (from requests->nba_api) (1.26.7)
Building wheels for collected packages: nba-api
  Building wheel for nba-api (setup.py): started
  Building wheel for nba-api (setup.py): finished with status 'done'
  Created wheel for nba-api: filename=nba_api-1.1.11-py3-none-any.whl size=251504 sha256=9bd4d7d7e5ed419c98ef588c7d7ed0a297b77d52fd9815f25a39bf5e5091f87c
  Stored in directory: c:\users\user\appdata\local\pip\cache\wheels\66\c2\3b\c87a243f9e5d2449e7f2c7bd65de4a6b5ce9a24b33978398a7
Successfully built nba-api
Installing collected packages: nba-api
Successfully installed nba-api-1.1.11

In [3]:
from nba_api.stats.static import teams

In [4]:
nba_teams = teams.get_teams()

In [6]:
nba_teams[:5]

[{'id': 1610612737,
  'full_name': 'Atlanta Hawks',
  'abbreviation': 'ATL',
  'nickname': 'Hawks',
  'city': 'Atlanta',
  'state': 'Atlanta',
  'year_founded': 1949},
 {'id': 1610612738,
  'full_name': 'Boston Celtics',
  'abbreviation': 'BOS',
  'nickname': 'Celtics',
  'city': 'Boston',
  'state': 'Massachusetts',
  'year_founded': 1946},
 {'id': 1610612739,
  'full_name': 'Cleveland Cavaliers',
  'abbreviation': 'CLE',
  'nickname': 'Cavaliers',
  'city': 'Cleveland',
  'state': 'Ohio',
  'year_founded': 1970},
 {'id': 1610612740,
  'full_name': 'New Orleans Pelicans',
  'abbreviation': 'NOP',
  'nickname': 'Pelicans',
  'city': 'New Orleans',
  'state': 'Louisiana',
  'year_founded': 2002},
 {'id': 1610612741,
  'full_name': 'Chicago Bulls',
  'abbreviation': 'CHI',
  'nickname': 'Bulls',
  'city': 'Chicago',
  'state': 'Illinois',
  'year_founded': 1966}]

In [ ]:
##### To make things easier we can combine the dictionary to a table , to achieve this , we will first create the function( one dict), 
##### to create a dictionary, we use the common keys for each team as the keys, the value is a list, each element of the list corressponds
##### to the values for each team , we then convert the dictionary to a dataframe, each row contains the information for a different team.
##### we use the teams nickname to find the unique id , We can also find the rows that contains the warriors as follows, id is the first column
##### you can use the following line of code to accsee the first column of the DataFrame. we now have the integer that will be used to request
##### the warriors information

In [21]:
def one_dict(list_dict): # create function one dict
    keys=list_dict[0].keys()  # use common key as the keys
    out_dict={key:[] for key in keys} # put in list form
    for dict_in list_dict:
        for key, value in dict_.items():
            out_dict[key].append(value)     
    return out_dict

SyntaxError: invalid syntax (Temp/ipykernel_16260/2220150866.py, line 4)

In [23]:
  # convert the dictionary to a DataFrame
    dict_nba_team=one_dict(nba_teams)
        df_teams=pd.DataFrame(dict_nba_team) 
        df_teams.head()

IndentationError: unexpected indent (Temp/ipykernel_16260/2403520601.py, line 2)

In [24]:
# using the teams nickname to find the unique id

In [25]:
# To find the rows that contains the warriors
df_warriors=df_teams[df_teams['nickname']=='Warriors']
df_warriors

NameError: name 'df_teams' is not defined

In [26]:
id_warriors=df_warriors[['id']].values[0][0]

NameError: name 'df_warriors' is not defined

In [ ]:
##### The function leaguegame finder bwill make an API call,the parameter the unique id nullable is the unique id for the warriors,under the hall
##### nba api is making an http requests and it is transmitted to nba.com.The information requested is provided an is transmitted via an http Response
##### and this is a sign to the object gamefinder. The game finder object has a method get data frame and this returns the DataFrame and this gives infor
3#3## about all the games that the warriors played,PLUS MINUS column contains information on the scores, if the value is negative, the warriors lost by 
##### that many scores an if it is possitive ,then they won by that amount of point. The column MATCH UP has the teams the wariors were playing. 
##### GsW stands for GOLDEN STEAD and  TOR means TORANO RACTERS, and VS signifies that it was a home game and the @ symbol means an away game.
##### We can create two dataframes, one the game where the warriors has to face the Racters at home and the second for the away games.

In [4]:
from nba_api.stats.endpoints import leaguegamefinder

AttributeError: module 'nba_api.stats.endpoints.leaguegamefinder' has no attribute 'leagueGameFinder'

In [ ]:
gamefinder=leaguegamefinder.leagueGameFinder(team_id_nullable=id_warriors)

In [2]:
game = gamefinder.get_data_frames()[0]
games.head()

NameError: name 'gamefinder' is not defined

In [ ]:
#create DataFrame for the warriors away game and home game
games_home=games[games['MATCHUP']=='GSW vs.TOR']
games_away=games[games['MATCHUP']=='GSW vs.TOR']
ax.legend(["away","home"])
plt.show()

In [ ]:
fig,ax=plt.subplots()
games_home=games[games['MATCHUP']=='GSW vs.TOR']
games_away=games[games['MATCHUP']=='GSW vs.TOR']

### How to use SQlite database with python

##### Load necessary libaries

In [ ]:
import sqlite3

In [ ]:
#you can also open with sql viewer

In [ ]:
# open a connection to sqlite database, to achieve that, 
#make connection and specify the file where the data will be stored(data.db) but u can use any file name you want ,
#and this file will automatically be created when we run our program
#connection = sqlite3.connect('data.db')
#cursor = connection.cursor() # you need a cursor to interate with the database 
#
# We will then use an sql language to generate our table and query our database(use cursor .execute and specify the 
#string we will use in creating our table)
# sql is vary famous in creating databases and our tables
# We are going to create a table called 'STUDENT'and provide a name that will constitute our table
# The sql language to use is ('CREATE TABLE STUDENTS')
# Here we are using just 2 columns name  of the student, remember to specify the type, here is text, then the next column Gender also a text
# ('CREATE TABLE STUDENTS(Name text, gender text)')
# the table is empty and we have to populate it, to insert data into our table we will use the execute function
# note ,we have to provide our values,secondly ,we change the outer cut to (")(double quote and inner query single quote(') to avoid confusio
#cursor.execute("INSERT INTO STUDENT VALUES('Max', 'M')")
#cursor.execute("INSERT INTO STUDENT VALUES('Sally', 'F')") 
#cursor.execute("INSERT INTO STUDENT VALUES('Sarah', 'F')") 
# After this we need to commit our data with the syntax below
#connection.commit()
# we also need to close our data using the close function
# connection.close()
# In summary,on how to create an sql script, import sqlite3 ,open a connection,and connect to a data base file, remember to name your data
#Create table and insert data using sql language, then commit your work so as to execute all the sql queries you have entered then close 
# your connectio, In order to view the content after creation , just go on line and search for 'sqlite viewer' paste the data you just
#created on it and you will be able to view your table.

In [ ]:
#df2 = pd.read_sql('SELECT * STUDENTS;', connection, replace)

In [ ]:
#df2.head()

In [ ]:
import sqlite3

In [ ]:
connection = sqlite3.connect('data.db')

cursor = connection.cursor()

cursor.execute("CREATE TABLE STUDENT (Name text, Gender text)")
cursor.execute("INSERT INTO STUDENT VALUES('Max', 'M')") 
cursor.execute("INSERT INTO STUDENT VALUES('Sally', 'F')") 
cursor.execute("INSERT INTO STUDENT VALUES('Sarah', 'F')") 

connection.commit()

connection.close()

In [ ]:
connection = sqlite3.connect('data.db')

In [ ]:
# How to view your table on pyhon jupiter notebook or lab

In [ ]:
df2 = pd.read_sql('SELECT * STUDENT', connection)

In [ ]:
df2.head()

In [ ]:
pd.DataFrame().to_sql('STUDENTS', connection,
                      if_exists= 'replace')

In [ ]:
df2 = pd.read_sql('select * from student;', connection
                 )
df2.head()
pd.DataFrame().to_sql('employees2',
                      conn,)
                      
pd.read_sql_query('SELECT * FROM employees2;', conn).head()

pd.read_sql_query('SELECT * FROM employees2;'

In [ ]:
# https://notepad-plus-plus.org/downloads/